In [54]:
sc.stop()

In [1]:
import os
import sys
from pyspark import SparkContext
from pyspark.sql import SQLContext
import pyspark.sql.types as sqlt
import pyspark.sql.functions as sqlf
from pyspark import SparkConf
try:
    sc.stop()
except:
    pass
os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

#HDFS_MASTER = 'hadoop-master'
conf = SparkConf()
conf.setMaster('local')
conf.setAppName('spark-test')
sc = SparkContext(conf=conf)
sqlContext = SQLContext(sc)
spark = sqlContext
sql = spark.sql

WARNING: User-defined SPARK_HOME (/opt/cloudera/parcels/CDH-6.2.0-1.cdh6.2.0.p0.967373/lib/spark) overrides detected (/opt/cloudera/parcels/CDH/lib/spark).
WARNING: Running spark-class from user-defined location.
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/08/06 15:43:07 WARN lineage.LineageWriter: Lineage directory /var/log/spark/lineage doesn't exist or is not writable. Lineage for this application will be disabled.

In [ ]:
from pyspark.sql.functions import countDistinct
df.select(countDistinct("column_name"))  # Возвращает количество уникальных значений в столбце "column_name"

In [ ]:
from pyspark.sql.functions import split
df.select(split("column_name", ","))  # Разделяет значение в столбце "column_name" по разделителю "," и возвращает массив с разбитыми значениями

In [ ]:
from pyspark.sql.functions import dayofweek
df.select(dayofweek("date_column"))  # Возвращает номер дня недели (1-7) для значения в столбце "date_column"

In [ ]:
from pyspark.sql.functions import concat
df.select(concat("column1", "column2").alias("concat_column"))  # Соединяет значения столбцов "column1" и "column2" в новый столбец "concat_column"

In [ ]:
from pyspark.sql.functions import length, min
df.select(min(length("column_name")))  # Возвращает наименьшую длину строки в столбце "column_name"

In [ ]:
from pyspark.sql.functions import sum
df.select(sum("column_name"))  # Возвращает сумму значений в столбце "column_name"

In [ ]:
from pyspark.sql.functions import lit
df.select(lit("new_value").alias("column_name"))  # Заменяет все значения столбца "column_name" на "new_value"

In [ ]:
from pyspark.sql.functions import upper
df.select(upper("column_name"))  # Преобразует значения столбца "column_name" в верхний регистр

In [ ]:
from pyspark.sql.functions import count
df.groupby("column_name").agg(count("column_name"))  # Группирует строки по значениям в столбце "column_name" и возвращает количество строк в каждой группе

In [ ]:
from pyspark.sql.functions import col
df.dropDuplicates(["column1", "column2"])  # Удаляет дубликаты строк, оставляя только уникальные значения в столбцах "column1" и "column2"

In [ ]:
from pyspark.sql.functions import to_date
df.select(to_date("column_name"))  # Преобразует значение в столбце "column_name" в формат даты

In [ ]:
from pyspark.sql.functions import floor
df.select(floor("column_name"))  # Отбрасывает десятичную часть чисел в столбце "column_name"

In [ ]:
from pyspark.sql.functions import substring
df.select(substring("column_name", 1, N))  # Возвращает первые N символов строки в столбце "column_name"

In [ ]:
from pyspark.sql.functions import lit
df.filter(col("column_name").isin([val1, val2, val3]))  # Отбирает строки, содержащие значения из столбца "column_name", которые присутствуют в списке [val1, val2, val3]

In [ ]:
from pyspark.sql.functions import regexp_replace
df.select(regexp_replace("column_name", "[^\w\s]", ""))  # Удаляет все символы пунктуации из значений в столбце "column_name"

In [ ]:
from pyspark.sql.functions import col
df.select(col("column_name").cast("float"))  # Преобразует значение в столбце "column_name" в число с плавающей запятой

In [ ]:
from pyspark.sql.functions import year
df.select(year("date_column"))  # Извлекает год из значения в столбце "date_column"

In [ ]:
from pyspark.sql.functions import col
df.select(col("column_name").cast("boolean"))  # Преобразует значение в столбце "column_name" в логический тип данных ("true" или "false")

In [ ]:
from pyspark.sql.functions import explode, split
df.select(explode(split("column_name", ":")))  # Преобразует одну строку с несколькими значениями в отдельные строки, разделяя их по разделителю ":"

In [ ]:
from pyspark.sql.functions import col
df.filter(col("column_name").contains("substring"))  # Отбирает строки, содержащие подстроку "substring" в значении столбца "column_name"

### Для заданий 2-11 нужно написать два варианта решения, через Spark SQL и через PySpark API.

Задание 1. Загрузите файл в Spark DataFrame hdfs:///user/data_loader/new_folder/Salary_Data_Based_country_and_race.csv. 
Запишите таблицу в parquet hive table в свою схему, убедитесь, что заголовки корректны.

In [2]:
df = spark.read.csv('hdfs:///user/std03/Salary_Data_Based_country_and_race.csv', header = True)

23/08/06 15:43:18 WARN lineage.LineageWriter: Lineage directory /var/log/spark/lineage doesn't exist or is not writable. Lineage for this application will be disabled.

In [3]:
df.explain(1)

== Parsed Logical Plan ==
Relation[_c0#10,Age#11,Gender#12,Education Level#13,Job Title#14,Years of Experience#15,Salary#16,Country#17,Race#18] csv

== Analyzed Logical Plan ==
_c0: string, Age: string, Gender: string, Education Level: string, Job Title: string, Years of Experience: string, Salary: string, Country: string, Race: string
Relation[_c0#10,Age#11,Gender#12,Education Level#13,Job Title#14,Years of Experience#15,Salary#16,Country#17,Race#18] csv

== Optimized Logical Plan ==
Relation[_c0#10,Age#11,Gender#12,Education Level#13,Job Title#14,Years of Experience#15,Salary#16,Country#17,Race#18] csv

== Physical Plan ==
*(1) FileScan csv [_c0#10,Age#11,Gender#12,Education Level#13,Job Title#14,Years of Experience#15,Salary#16,Country#17,Race#18] Batched: false, Format: CSV, Location: InMemoryFileIndex[hdfs://node01.tec.lan:8020/user/std03/Salary_Data_Based_country_and_race.csv], PartitionFilters: [], PushedFilters: [], ReadSchema: struct<_c0:string,Age:string,Gender:string,Education Level:string,Job Title:string,Years of Exper...

In [4]:
df

DataFrame[_c0: string, Age: string, Gender: string, Education Level: string, Job Title: string, Years of Experience: string, Salary: string, Country: string, Race: string]

In [5]:
df = df.withColumnRenamed("Education Level", "Education_Level").withColumnRenamed('Job Title', 'Job_Title').withColumnRenamed("Years of Experience", "Years_of_Experience").withColumnRenamed('_c0', 'id')

In [6]:
df.show(truncate=False)

+---+----+------+---------------+---------------------+-------------------+--------+---------+----------------+
|id |Age |Gender|Education_Level|Job_Title            |Years_of_Experience|Salary  |Country  |Race            |
+---+----+------+---------------+---------------------+-------------------+--------+---------+----------------+
|0  |32.0|Male  |Bachelor's     |Software Engineer    |5.0                |90000.0 |UK       |White           |
|1  |28.0|Female|Master's       |Data Analyst         |3.0                |65000.0 |USA      |Hispanic        |
|2  |45.0|Male  |PhD            |Senior Manager       |15.0               |150000.0|Canada   |White           |
|3  |36.0|Female|Bachelor's     |Sales Associate      |7.0                |60000.0 |USA      |Hispanic        |
|4  |52.0|Male  |Master's       |Director             |20.0               |200000.0|USA      |Asian           |
|5  |29.0|Male  |Bachelor's     |Marketing Analyst    |2.0                |55000.0 |USA      |Hispanic        |
|6  |42.0|Female|Master's       |Product Manager      |12.0               |120000.0|USA      |Asian           |
|7  |31.0|Male  |Bachelor's     |Sales Manager        |4.0                |80000.0 |China    |Korean          |
|8  |26.0|Female|Bachelor's     |Marketing Coordinator|1.0                |45000.0 |China    |Chinese         |
|9  |38.0|Male  |PhD            |Senior Scientist     |10.0               |110000.0|Australia|Australian      |
|10 |29.0|Male  |Master's       |Software Developer   |3.0                |75000.0 |UK       |Welsh           |
|11 |48.0|Female|Bachelor's     |HR Manager           |18.0               |140000.0|UK       |Asian           |
|12 |35.0|Male  |Bachelor's     |Financial Analyst    |6.0                |65000.0 |China    |Korean          |
|13 |40.0|Female|Master's       |Project Manager      |14.0               |130000.0|USA      |African American|
|14 |27.0|Male  |Bachelor's     |Customer Service Rep |2.0                |40000.0 |Canada   |Asian           |
|15 |44.0|Male  |Bachelor's     |Operations Manager   |16.0               |125000.0|China    |Chinese         |
|16 |33.0|Female|Master's       |Marketing Manager    |7.0                |90000.0 |USA      |Asian           |
|17 |39.0|Male  |PhD            |Senior Engineer      |12.0               |115000.0|UK       |Mixed           |
|18 |25.0|Female|Bachelor's     |Data Entry Clerk     |0.0                |35000.0 |UK       |Asian           |
|19 |51.0|Male  |Bachelor's     |Sales Director       |22.0               |180000.0|Australia|Asian           |
+---+----+------+---------------+---------------------+-------------------+--------+---------+----------------+
only showing top 20 rows

23/08/06 15:43:28 WARN csv.CSVDataSource: CSV header does not conform to the schema.
 Header: , Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
 Schema: _c0, Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
Expected: _c0 but found:
CSV file: hdfs://node01.tec.lan:8020/user/std03/Salary_Data_Based_country_and_race.csv

In [7]:
df.schema

StructType(List(StructField(id,StringType,true),StructField(Age,StringType,true),StructField(Gender,StringType,true),StructField(Education_Level,StringType,true),StructField(Job_Title,StringType,true),StructField(Years_of_Experience,StringType,true),StructField(Salary,StringType,true),StructField(Country,StringType,true),StructField(Race,StringType,true)))

In [8]:
df_p = df.write.format('parquet').mode('overwrite').saveAsTable('ivanov.salary_p')

23/08/06 15:43:32 WARN csv.CSVDataSource: CSV header does not conform to the schema.
 Header: , Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
 Schema: _c0, Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
Expected: _c0 but found:
CSV file: hdfs://node01.tec.lan:8020/user/std03/Salary_Data_Based_country_and_race.csv
[Stage 2:>                                                          (0 + 1) / 1]SLF4J: Class path contains multiple SLF4J bindings.
SLF4J: Found binding in [jar:file:/opt/cloudera/parcels/CDH-6.2.0-1.cdh6.2.0.p0.967373/jars/parquet-format-2.3.1-cdh6.2.0.jar!/shaded/parquet/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/opt/cloudera/parcels/CDH-6.2.0-1.cdh6.2.0.p0.967373/lib/spark/hive/hive-exec-2.1.1-cdh6.2.0.jar!/shaded/parquet/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: See http://www.slf4j.org/codes.html#multiple_bindings for an explanation.
SLF4J: Actual binding is of type [shaded.parquet.org.slf4j.helpers.NOPLoggerFactory]

In [9]:
spark.table('ivanov.salary_p')

DataFrame[id: string, Age: string, Gender: string, Education_Level: string, Job_Title: string, Years_of_Experience: string, Salary: string, Country: string, Race: string]

In [10]:
spark.table('ivanov.salary_p').schema

StructType(List(StructField(id,StringType,true),StructField(Age,StringType,true),StructField(Gender,StringType,true),StructField(Education_Level,StringType,true),StructField(Job_Title,StringType,true),StructField(Years_of_Experience,StringType,true),StructField(Salary,StringType,true),StructField(Country,StringType,true),StructField(Race,StringType,true)))

In [11]:
spark.table('ivanov.salary_p').show()

+---+----+------+---------------+--------------------+-------------------+--------+---------+----------------+
| id| Age|Gender|Education_Level|           Job_Title|Years_of_Experience|  Salary|  Country|            Race|
+---+----+------+---------------+--------------------+-------------------+--------+---------+----------------+
|  0|32.0|  Male|     Bachelor's|   Software Engineer|                5.0| 90000.0|       UK|           White|
|  1|28.0|Female|       Master's|        Data Analyst|                3.0| 65000.0|      USA|        Hispanic|
|  2|45.0|  Male|            PhD|      Senior Manager|               15.0|150000.0|   Canada|           White|
|  3|36.0|Female|     Bachelor's|     Sales Associate|                7.0| 60000.0|      USA|        Hispanic|
|  4|52.0|  Male|       Master's|            Director|               20.0|200000.0|      USA|           Asian|
|  5|29.0|  Male|     Bachelor's|   Marketing Analyst|                2.0| 55000.0|      USA|        Hispanic|
|  6|42.0|Female|       Master's|     Product Manager|               12.0|120000.0|      USA|           Asian|
|  7|31.0|  Male|     Bachelor's|       Sales Manager|                4.0| 80000.0|    China|          Korean|
|  8|26.0|Female|     Bachelor's|Marketing Coordin...|                1.0| 45000.0|    China|         Chinese|
|  9|38.0|  Male|            PhD|    Senior Scientist|               10.0|110000.0|Australia|      Australian|
| 10|29.0|  Male|       Master's|  Software Developer|                3.0| 75000.0|       UK|           Welsh|
| 11|48.0|Female|     Bachelor's|          HR Manager|               18.0|140000.0|       UK|           Asian|
| 12|35.0|  Male|     Bachelor's|   Financial Analyst|                6.0| 65000.0|    China|          Korean|
| 13|40.0|Female|       Master's|     Project Manager|               14.0|130000.0|      USA|African American|
| 14|27.0|  Male|     Bachelor's|Customer Service Rep|                2.0| 40000.0|   Canada|           Asian|
| 15|44.0|  Male|     Bachelor's|  Operations Manager|               16.0|125000.0|    China|         Chinese|
| 16|33.0|Female|       Master's|   Marketing Manager|                7.0| 90000.0|      USA|           Asian|
| 17|39.0|  Male|            PhD|     Senior Engineer|               12.0|115000.0|       UK|           Mixed|
| 18|25.0|Female|     Bachelor's|    Data Entry Clerk|                0.0| 35000.0|       UK|           Asian|
| 19|51.0|  Male|     Bachelor's|      Sales Director|               22.0|180000.0|Australia|           Asian|
+---+----+------+---------------+--------------------+-------------------+--------+---------+----------------+
only showing top 20 rows

In [12]:
spark.table('ivanov.salary_p').count()

6704

In [13]:
df_pa = df.write.mode("overwrite").parquet("hdfs:///user/std03/salary_pa.parquet")

23/08/06 15:43:38 WARN csv.CSVDataSource: CSV header does not conform to the schema.
 Header: , Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
 Schema: _c0, Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
Expected: _c0 but found:
CSV file: hdfs://node01.tec.lan:8020/user/std03/Salary_Data_Based_country_and_race.csv

In [14]:
df_par = spark.read.parquet("hdfs:///user/std03/salary_pa.parquet")

In [15]:
df_par

DataFrame[id: string, Age: string, Gender: string, Education_Level: string, Job_Title: string, Years_of_Experience: string, Salary: string, Country: string, Race: string]

In [16]:
df_par.count()

6704

In [17]:
from pyspark.sql.types import StructType, StructField, IntegerType, StringType, FloatType
employeesSchema = StructType([
    StructField("id", IntegerType()),
    StructField("Age", FloatType()),
    StructField("Gender", StringType()),
    StructField("Education_Level", StringType()),
    StructField("Job_Title", StringType()),
    StructField("Years_of_Experience", FloatType()),
    StructField("Salary", FloatType()),
    StructField("Country", StringType()),
    StructField("Race", StringType())
])

In [18]:
df_s = spark.read.csv('hdfs:///user/std03/Salary_Data_Based_country_and_race.csv', header = True, schema = employeesSchema)

In [19]:
df_s

DataFrame[id: int, Age: float, Gender: string, Education_Level: string, Job_Title: string, Years_of_Experience: float, Salary: float, Country: string, Race: string]

In [20]:
df_s.schema

StructType(List(StructField(id,IntegerType,true),StructField(Age,FloatType,true),StructField(Gender,StringType,true),StructField(Education_Level,StringType,true),StructField(Job_Title,StringType,true),StructField(Years_of_Experience,FloatType,true),StructField(Salary,FloatType,true),StructField(Country,StringType,true),StructField(Race,StringType,true)))

In [21]:
df_p = df_s.write.format('parquet').mode('overwrite').saveAsTable('ivanov.salary_pa')

23/08/06 15:43:50 WARN csv.CSVDataSource: CSV header does not conform to the schema.
 Header: , Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race
 Schema: id, Age, Gender, Education_Level, Job_Title, Years_of_Experience, Salary, Country, Race
Expected: id but found:
CSV file: hdfs://node01.tec.lan:8020/user/std03/Salary_Data_Based_country_and_race.csv

Задание 2. Найдите средний возраст для каждого образовательного уровня в таблице.

In [22]:
spark.table('ivanov.salary_pa').groupBy("Education_Level").agg(sqlf.avg("Age").alias("avgAge")).show(truncate=False)

+-----------------+------------------+
|Education_Level  |avgAge            |
+-----------------+------------------+
|High School      |26.854910714285715|
|Master's Degree  |35.40241576605213 |
|Bachelor's Degree|30.354653727393032|
|null             |27.0              |
|PhD              |41.16520467836257 |
|phD              |27.0              |
|Bachelor's       |29.978835978835978|
|Master's         |33.895833333333336|
+-----------------+------------------+

In [23]:
spark.sql('''select Education_Level, avg(Age) as avgAge
                from ivanov.salary_pa
                group by Education_Level''').show(truncate=False)

+-----------------+------------------+
|Education_Level  |avgAge            |
+-----------------+------------------+
|High School      |26.854910714285715|
|Master's Degree  |35.40241576605213 |
|Bachelor's Degree|30.354653727393032|
|null             |27.0              |
|PhD              |41.16520467836257 |
|phD              |27.0              |
|Bachelor's       |29.978835978835978|
|Master's         |33.895833333333336|
+-----------------+------------------+

Задание 3. Найдите образовательный уровень с наибольшим количеством работников.

In [28]:
(spark.table('ivanov.salary_pa')
.groupBy("Education_Level").count().orderBy(sqlf.col("count").desc()).select("Education_Level").show(1))

[Stage 47:=============================>                        (110 + 1) / 200]

+-----------------+
|  Education_Level|
+-----------------+
|Bachelor's Degree|
+-----------------+
only showing top 1 row

In [25]:
spark.sql('''
            with t1 as
            (select Education_Level, count(Education_Level) as count
                from ivanov.salary_pa
                group by Education_Level
                
            
            )
             select Education_Level from t1
             where count = 
             (select max(count) from t1)
            
            ''').show(truncate=False)

+-----------------+
|Education_Level  |
+-----------------+
|Bachelor's Degree|
+-----------------+

Задание 4. Найдите средний доход для каждой страны и пола.

In [33]:
(spark.table('ivanov.salary_pa')
.groupBy(["Gender", 'Country']).agg(sqlf.avg("salary").alias("avg_s"))
.orderBy(sqlf.col("Gender"))
.filter(sqlf.col("Gender").isNotNull())
.show(truncate=False))

+------+---------+------------------+
|Gender|Country  |avg_s             |
+------+---------+------------------+
|Female|UK       |108456.69293924466|
|Female|China    |111291.21150592217|
|Female|USA      |104992.6904376013 |
|Female|Australia|107913.5651465798 |
|Female|Canada   |106884.71134020618|
|Male  |UK       |122175.69475138122|
|Male  |USA      |119683.1204330176 |
|Male  |China    |120226.3128342246 |
|Male  |Australia|120896.76421636615|
|Male  |Canada   |123982.06486486486|
|Other |China    |112516.75         |
|Other |Australia|104127.0          |
|Other |UK       |129797.0          |
|Other |Canada   |161347.0          |
|Other |USA      |111517.33333333333|
+------+---------+------------------+

In [30]:
spark.sql('''
            with t1 as
            (select Gender, Country, avg(salary) as avg
                from ivanov.salary_pa
                group by Gender, Country
                order by Gender
            
            )
             select * from t1
             where Gender is not null
            
            ''').show(truncate=False)

+------+---------+------------------+
|Gender|Country  |avg               |
+------+---------+------------------+
|Female|UK       |108456.69293924466|
|Female|China    |111291.21150592217|
|Female|USA      |104992.6904376013 |
|Female|Australia|107913.5651465798 |
|Female|Canada   |106884.71134020618|
|Male  |UK       |122175.69475138122|
|Male  |USA      |119683.1204330176 |
|Male  |China    |120226.3128342246 |
|Male  |Australia|120896.76421636615|
|Male  |Canada   |123982.06486486486|
|Other |China    |112516.75         |
|Other |Australia|104127.0          |
|Other |UK       |129797.0          |
|Other |Canada   |161347.0          |
|Other |USA      |111517.33333333333|
+------+---------+------------------+

Задание 5. Найдите медианный возраст для каждой расы в таблице.

In [34]:
spark.table('ivanov.salary_pa').groupBy('Race').agg(sqlf.expr('percentile(age, 0.5)').alias('median')).show()

+----------------+------+
|            Race|median|
+----------------+------+
|         Chinese|  31.0|
|African American|  32.0|
|      Australian|  32.0|
|           Mixed|  32.0|
|          Korean|  32.0|
|           White|  32.0|
|        Hispanic|  31.0|
|           Black|  32.0|
|           Asian|  31.0|
|           Welsh|  32.0|
+----------------+------+

In [6]:
# pip install numpy

In [35]:
import numpy as np
def find_median(values_list):
    try:
        median = np.median(values_list) #get the median of values in a list in each row
        return round(float(median), 2)
    except Exception:
        return None #if there is anything wrong with the given values

median_finder = sqlf.udf(find_median,FloatType())

In [36]:
salaries_list = spark.table('ivanov.salary_pa').groupBy('Race').agg(sqlf.collect_list("age").alias("age"))
salaries_list.withColumn("median", median_finder("age")).select("Race", "median").show()

[Stage 77:=======================================================>(74 + 1) / 75]

+----------------+------+
|            Race|median|
+----------------+------+
|         Chinese|  31.0|
|African American|  32.0|
|      Australian|  32.0|
|           Mixed|  32.0|
|          Korean|  32.0|
|           White|  32.0|
|        Hispanic|  31.0|
|           Black|  32.0|
|           Asian|  31.0|
|           Welsh|  32.0|
+----------------+------+

In [37]:
spark.sql('''
           WITH tab AS 
                (
                SELECT Race, age, COUNT(*) OVER (partition by Race) AS cnt,
                    ROW_NUMBER() OVER (partition by race ORDER BY age) AS rn
                FROM ivanov.salary_pa
                )
                SELECT Race, age as median
                FROM tab
                WHERE rn IN ((Cnt+1)/2, (Cnt+2)/2)         
            
            ''').show(truncate=False)

+----------------+------+
|Race            |median|
+----------------+------+
|Chinese         |31.0  |
|African American|32.0  |
|Australian      |32.0  |
|Mixed           |32.0  |
|Korean          |32.0  |
|White           |32.0  |
|Black           |32.0  |
|Hispanic        |31.0  |
|Asian           |31.0  |
|Welsh           |32.0  |
+----------------+------+

Задание 6. Найдите общую суммарную зарплату для каждой работы.

In [38]:
spark.table('ivanov.salary_pa').groupBy("Job_Title").agg(sqlf.sum("salary").alias("sum_salary")).show(truncate=False)

+----------------------------------+-----------+
|Job_Title                         |sum_salary |
+----------------------------------+-----------+
|Digital Marketing Manager         |4850000.0  |
|Product Designer                  |4215000.0  |
|Senior Sales Manager              |265000.0   |
|Senior Software Architect         |120000.0   |
|Financial Manager                 |1.917E7    |
|Event Coordinator                 |105000.0   |
|Financial Analyst                 |3420000.0  |
|Senior Product Marketing Manager  |8735000.0  |
|Business Intelligence Analyst     |85000.0    |
|Junior Software Engineer          |2569000.0  |
|Senior IT Consultant              |220000.0   |
|Sales Executive                   |1635000.0  |
|Senior Researcher                 |150000.0   |
|Senior Project Engineer           |5.2859472E7|
|Network Engineer                  |60000.0    |
|Sales Associate                   |2510000.0  |
|Public Relations Manager          |90000.0    |
|Junior Business Analyst           |400000.0   |
|Digital Marketing Specialist      |950000.0   |
|Junior Customer Support Specialist|35000.0    |
+----------------------------------+-----------+
only showing top 20 rows

In [39]:
spark.sql('''
               SELECT Job_Title, sum(salary)  AS sum_salary
               FROM ivanov.salary_pa
               group by Job_Title
                  
            ''').show(truncate=False)

+----------------------------------+-----------+
|Job_Title                         |sum_salary |
+----------------------------------+-----------+
|Digital Marketing Manager         |4850000.0  |
|Product Designer                  |4215000.0  |
|Senior Sales Manager              |265000.0   |
|Senior Software Architect         |120000.0   |
|Financial Manager                 |1.917E7    |
|Event Coordinator                 |105000.0   |
|Financial Analyst                 |3420000.0  |
|Senior Product Marketing Manager  |8735000.0  |
|Business Intelligence Analyst     |85000.0    |
|Junior Software Engineer          |2569000.0  |
|Senior IT Consultant              |220000.0   |
|Sales Executive                   |1635000.0  |
|Senior Researcher                 |150000.0   |
|Senior Project Engineer           |5.2859472E7|
|Network Engineer                  |60000.0    |
|Sales Associate                   |2510000.0  |
|Public Relations Manager          |90000.0    |
|Junior Business Analyst           |400000.0   |
|Digital Marketing Specialist      |950000.0   |
|Junior Customer Support Specialist|35000.0    |
+----------------------------------+-----------+
only showing top 20 rows

In [40]:
spark.sql('''
               SELECT distinct(Job_Title), sum(salary) OVER (partition by Job_Title) AS sum_salary
               FROM ivanov.salary_pa
                  
            ''').show(truncate=False)

+----------------------------------+-----------+
|Job_Title                         |sum_salary |
+----------------------------------+-----------+
|Digital Marketing Manager         |4850000.0  |
|Product Designer                  |4215000.0  |
|Senior Sales Manager              |265000.0   |
|Senior Software Architect         |120000.0   |
|Event Coordinator                 |105000.0   |
|Financial Manager                 |1.917E7    |
|Financial Analyst                 |3420000.0  |
|Senior Product Marketing Manager  |8735000.0  |
|Business Intelligence Analyst     |85000.0    |
|Junior Software Engineer          |2569000.0  |
|Senior IT Consultant              |220000.0   |
|Sales Executive                   |1635000.0  |
|Senior Project Engineer           |5.2859472E7|
|Senior Researcher                 |150000.0   |
|Network Engineer                  |60000.0    |
|Public Relations Manager          |90000.0    |
|Sales Associate                   |2510000.0  |
|Digital Marketing Specialist      |950000.0   |
|Junior Business Analyst           |400000.0   |
|Junior Customer Support Specialist|35000.0    |
+----------------------------------+-----------+
only showing top 20 rows

Задание 7. Найдите страну с самой высокой средней зарплатой.

In [41]:
spark.table('ivanov.salary_pa').groupBy("Country").agg(sqlf.mean("salary").alias("avg_salary")).sort("avg_salary", ascending=False).show(1, truncate=False)

[Stage 113:====================================================>(198 + 1) / 200]

+-------+------------------+
|Country|avg_salary        |
+-------+------------------+
|Canada |116556.73283018867|
+-------+------------------+
only showing top 1 row

In [42]:
spark.sql('''
               SELECT Country, avg(salary)  AS avg_salary
               FROM ivanov.salary_pa
               group by Country
               order by avg_salary desc
               limit 1
                  
            ''').show(truncate=False)

[Stage 115:========================================>            (153 + 4) / 200]

+-------+------------------+
|Country|avg_salary        |
+-------+------------------+
|Canada |116556.73283018867|
+-------+------------------+

In [43]:
# pip install pandas

Задание 8. Найдите наиболее распространенный образовательный уровень среди мужчин и женщин.

In [44]:
from pyspark.sql.window import Window

In [45]:
(spark.table('ivanov.salary_pa').groupBy(["gender", "Education_Level"]).count()
.withColumn('rn', sqlf.row_number().over(Window.partitionBy("gender").orderBy(sqlf.desc('count'))))
.filter("rn = 1")
.filter(sqlf.col("gender").isin(['Female', 'Male']))
.drop('count', 'rn')
.show(truncate=False))

+------+-----------------+
|gender|Education_Level  |
+------+-----------------+
|Female|Bachelor's Degree|
|Male  |Bachelor's Degree|
+------+-----------------+

In [46]:
spark.sql('''
            with t1 as (
               SELECT gender, Education_Level, count(Education_Level)  AS cnt
               FROM ivanov.salary_pa
               group by gender, Education_Level
               order by gender),
             t2  (select *,
             ROW_NUMBER() OVER (partition by gender ORDER BY cnt desc) AS rn
             from t1)
             
             select gender, Education_Level from t2
             where rn = 1 and gender in ('Female', 'Male' )
            
             
             
            ''').show(truncate=False)

[Stage 135:=======================================>             (149 + 1) / 200]

+------+-----------------+
|gender|Education_Level  |
+------+-----------------+
|Female|Bachelor's Degree|
|Male  |Bachelor's Degree|
+------+-----------------+

Задание 9. Найдите средний доход для каждой группы возраста (18-25, 26-35, 36-50, 51+).

In [47]:
df = spark.table('ivanov.salary_pa')
df

DataFrame[id: int, Age: float, Gender: string, Education_Level: string, Job_Title: string, Years_of_Experience: float, Salary: float, Country: string, Race: string]

In [48]:
(df
.withColumn("gr_age", sqlf.when(df.Age < 18.0, 0).when(df.Age <= 35.0, 1).when(df.Age <= 50.0, 2).when(df.Age > 50.0, 3))
.groupBy("gr_age").agg(sqlf.mean("salary").alias("avg_salary"))
.filter(sqlf.col("gr_age").isNotNull())
.show())

+------+-----------------+
|gr_age|       avg_salary|
+------+-----------------+
|     1|93236.54019933555|
|     3|191834.7513227513|
|     2| 158072.977443609|
+------+-----------------+

In [49]:
spark.sql('''
            with t1 as (
               SELECT gender, salary, age,
               case 
                    when age < 18.0 then 0
                    when age <=35.0 then 1
                    when age <=50.0 then 2
                    when age > 50.0 then 3
                    
              end gr_age
               FROM ivanov.salary_pa
               )
            
             
             select gr_age, avg(salary) as avg_salary from t1
             where gr_age is not null
             group by gr_age
             
             
            ''').show(truncate=False)

+------+-----------------+
|gr_age|avg_salary       |
+------+-----------------+
|1     |93236.54019933555|
|3     |191834.7513227513|
|2     |158072.977443609 |
+------+-----------------+

Задание 10. Найдите страны, где количество работников каждой расы превышает среднее количество работников по всем расам.

In [50]:
(df
.groupBy(['Country', 'race']).count().orderBy('Country')
.withColumn('avg', sqlf.mean('count').over(Window().partitionBy()))
.filter(sqlf.col("count") > sqlf.col("avg"))
.drop('count', 'race', 'avg')
.select('Country').distinct()
.show(truncate=False))

23/08/06 15:49:56 WARN window.WindowExec: No Partition Defined for Window operation! Moving all data to a single partition, this can cause serious performance degradation.
[Stage 163:============================================>        (167 + 2) / 200]

+---------+
|Country  |
+---------+
|Australia|
|Canada   |
|China    |
+---------+

In [51]:
spark.sql('''
            with t1 as (
               SELECT Country, race, count(race) as cnt
               FROM ivanov.salary_pa
               group by Country, race
               order by Country
               )
             
             select distinct Country from t1
             where cnt > (select avg(cnt) from t1)
            
             
            ''').show(truncate=False)

[Stage 175:=========================================>           (155 + 1) / 200]

+---------+
|Country  |
+---------+
|Australia|
|Canada   |
|China    |
+---------+

Задание 11. Найдите топ-3 работы с самой высокой средней зарплатой среди людей с опытом работы от 10 лет.

In [52]:
(df
.withColumn("exp_10", sqlf.when(df.Years_of_Experience >= 10.0, 10))
.filter(sqlf.col("exp_10") == 10)
.groupBy("Job_Title").agg(sqlf.mean("salary").alias("avg_s"))
.orderBy(sqlf.desc('avg_s'))
.show(3, truncate=False))

+------------------------+--------+
|Job_Title               |avg_s   |
+------------------------+--------+
|CEO                     |250000.0|
|Chief Technology Officer|250000.0|
|Chief Data Officer      |220000.0|
+------------------------+--------+
only showing top 3 rows

In [53]:
spark.sql('''
            with t1 as (
               SELECT Job_Title, salary, Years_of_Experience,
               case 
                    when Years_of_Experience >= 10.0 then 10
                                        
              end y
               FROM ivanov.salary_pa
               ), t2 as (
               select * from t1
               where y = 10
               ), t3 as (
               select Job_Title, avg(salary) avg_s from t2
               group by Job_Title
               order by avg_s desc
               limit 3
               )
               
            
             
             select * from t3
             
             
             
            ''').show(truncate=False)

[Stage 183:===================================================> (195 + 1) / 200]

+------------------------+--------+
|Job_Title               |avg_s   |
+------------------------+--------+
|CEO                     |250000.0|
|Chief Technology Officer|250000.0|
|Chief Data Officer      |220000.0|
+------------------------+--------+